trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/РаспределениеЗапасовСостояния/РаспределениеЗапасовСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545815ed-aef9-41ce-93e4-8bbe4895c3db">
  <name>РаспределениеЗапасовСостояния</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="47d10a43-5556-4259-bde6-880106968b77">
    <name>ОстатокНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9c0b62df-0832-4252-b100-7b5bbbb68ac8">
    <name>ОжидаемаяОтгрузка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/Forms/Док_ФормаДокументаТСД/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ВремяСохраненияДокументов = Константы.ВремяСохраненияДокументов.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
			
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь;
	
	Если Параметры.Свойство("Склад") Тогда
		Объект.Склад = Параметры.Склад;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДобавитьФотоТовара") Тогда
		ДобавитьФотоТовара = Параметры.ДобавитьФотоТовара; 
		Элементы.ГруппаЗагрузкиФотоТовараСДефектом.Видимость = Параметры.ДобавитьФотоТовара;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Комментарий = "Создан из ТСД: ";
		
		Если Параметры.Свойство("ПричинаБлокировки") Тогда
			Объект.ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(Параметры.ПричинаБлокировки, Истина);
		КонецЕсли;
		
		Если Параметры.Свойство("Номенклатура") Тогда
			
			Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
			Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
			
			Номенклатура = Параметры.Номенклатура;
			Характеристика = "";
			Количество = 1;
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Количество = Количество;
			НоваяСтрока.Характеристика = Характеристика;
			
			ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
			
			Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 = Параметр;
			Иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			КонецЕсли;

			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
			
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
			
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();
	 
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	ТекущаяСтрока.КоличествоУпаковок = Количество;

КонецПроцедуры

#КонецОбласти


 #Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;
  	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Отказ = Истина;

		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
		Элементы.ВыборНоменклатуры.Видимость = Истина;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;	
	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
	Элементы.ВыборНоменклатуры.Видимость = Ложь;   
		
	Номенклатура = "";
	Характеристика = "";
	Количество = 1;

	Номенклатура = Элементы.СписокНоменклатура1.ТекущиеДанные.Ссылка;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Характеристика = Характеристика;
	
	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоЯчейкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
	Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Ложь;
	
	Номенклатура = "";
	Характеристика = "";
	Количество = 1;

	Номенклатура = Элементы.НоменклатураПоЯчейке.ТекущиеДанные.Ссылка;
   	Характеристика = Элементы.НоменклатураПоЯчейке.ТекущиеДанные.Характеристика;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Характеристика = Характеристика;
	
	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);			
	ТекущаяСтрока.КоличествоУпаковок = Количество;
	
	Элементы.РедактированиеДокументаНаТСД.Видимость = Истина;
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь; 
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти


 #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Попытка
			глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
			глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
			глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрикодКамера(Команда) 
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод, Результат, Сообщение, ДопПараметры) Экспорт
	
	Если Результат И ЗначениеЗаполнено(Штрихкод) Тогда	
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		ДанныеСтруктура =  Новый Структура("Штрихкод, Количество", Штрихкод, 1);
		
		Данные = Новый Массив;
		Данные.Добавить(ДанныеСтруктура);		
		
		ОбработатьШтрихкоды(Данные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов) 
	
	Штрихкод = ДанныеШтрихкодов[0].Штрихкод;
	
	// Штрихкод ячейки
	Если СтрДлина(Штрихкод) > 35   Тогда	
		Если Элементы.РедактированиеДокументаНаТСД.Видимость И НЕ Элементы.РедактированиеСтрокиНаТСД.Видимость Тогда	
			МассивСсылок = СсылкаНаЯчейкуПоШтрихкоду(Штрихкод);	
			// Ячейка найдена
			Если МассивСсылок.Количество() > 0 Тогда
				НайденнаяЯчейка = МассивСсылок[0];		
				ОбработатьОтсканированнуюЯчейку(НайденнаяЯчейка);
			Иначе
				Сообщить("Ячейка не найдена");
			КонецЕсли;
		КонецЕсли;
	Иначе   	
		ОбработатьТоварПоШтрихкоду(ДанныеШтрихкодов);	
	КонецЕсли;        

	ЭтаФорма.ОбновитьОтображениеДанных();   
	
КонецПроцедуры    

&НаКлиенте
Функция СсылкаНаЯчейкуПоШтрихкоду(Штрихкод) 
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.СкладскиеЯчейки.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры); 
	
КонецФункции

&НаСервере
Процедура ОбработатьОтсканированнуюЯчейку(ОтсканированнаяЯчейка)
	
	Если Ячейка <> ОтсканированнаяЯчейка Тогда 	
		НоменклатураПоЯчейке.Очистить();
		ТоварыПоЯчейке = ПолучитьТоварыПоЯчейке(ОтсканированнаяЯчейка);
		НоменклатураПоЯчейке.Загрузить(ТоварыПоЯчейке);	  
		Ячейка = ОтсканированнаяЯчейка; 
	КонецЕсли;

	Если НоменклатураПоЯчейке.Количество()> 0 Тогда
		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь; 
		Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь;
		Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры  

&НаСервере
Функция ПолучитьТоварыПоЯчейке(ОтсканированнаяЯчейка);
	
	УстановитьПривилегированныйРежим(Истина);
	Если ОбеспечениеВДокументахСервер.ЭтоПроизводительныйРежим() Тогда  
		ТекстОстатки="
		|ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Ссылка,
		|	ЗапасыИПотребностиОстатки.Номенклатура.Код КАК Код,
		|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(
		|			,
		|			(Номенклатура, Склад) В
		|				(ВЫБРАТЬ
		|					ВТ_Номенклатура.Номенклатура,
		|					ВТ_Номенклатура.Склад
		|				ИЗ
		|					ВТ_Номенклатура КАК ВТ_Номенклатура)) КАК ЗапасыИПотребностиОстатки
		|ГДЕ
		|	ЗапасыИПотребностиОстатки.ВНаличииОстаток > 0";	
	иначе
		ТекстОстатки="
		|ВЫБРАТЬ
		|	РаспределениеЗапасов.Номенклатура КАК Ссылка,
		|	РаспределениеЗапасов.Номенклатура.Код КАК Код,
		|	РаспределениеЗапасов.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|ГДЕ
		|	(РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Склад) В
		|			(ВЫБРАТЬ
		|				ВТ_Номенклатура.Номенклатура,
		|				ВТ_Номенклатура.Склад
		|			ИЗ
		|				ВТ_Номенклатура КАК ВТ_Номенклатура)
		|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|   И РаспределениеЗапасов.ВНаличии > 0";	
	конецесли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|ГДЕ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка = &Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"+
	ТекстОстатки;
		
	Запрос.УстановитьПараметр("Ячейка", ОтсканированнаяЯчейка);
	Запрос.УстановитьПараметр("Склад", Объект.Склад); 
	Результат = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	  	
КонецФункции

&НаКлиенте
Процедура ОбработатьТоварПоШтрихкоду(ДанныеШтрихкодов)
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = Новый Структура;
	СтруктураДействий.ИзменятьКоличество = Истина;
	СтруктураДействий.ТолькоТовары = Истина;

	ОбработатьШтрихкодыСервер(СтруктураДействий, КэшированныеЗначения);
		
	Если СтруктураДействий.ТекущаяСтрока = Неопределено Тогда 
		#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли; 
		#КонецЕсли
		Сообщить("Штрихкод не найден!");		
	Иначе	
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока; 
		ТекущаяСтрокаТСД = СтруктураДействий.ТекущаяСтрока;
		ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма, Объект, СтруктураПараметровДействия, КэшированныеЗначения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрока)
	
	ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	Номенклатура = "";
	Характеристика = "";
	Количество = 0;
	АдресКартинки = "";
	
	Если ЭлементСписка <> Неопределено Тогда
		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
		Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
		Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Ложь;
		Номенклатура = ЭлементСписка.Номенклатура;
		Характеристика = ЭлементСписка.Характеристика;
		Количество = ЭлементСписка.КоличествоУпаковок;
		ПолучитьАдресКартинки(Номенклатура);
	Конецесли;		
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) Тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры 


#Область ДобавлениеФото 

&НаКлиенте
Процедура ЗагрузитьФотоТовара(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Данные не записаны!");
		Возврат;
	КонецЕсли; 
		
	Кнопки = КнопкиОповещения();
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа), "Загрузите фото.", Кнопки);
	
КонецПроцедуры

Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт  
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Если РезультатВопроса = "Камера" Тогда
			СделатьФотоКамерой();
		ИначеЕсли 
			РезультатВопроса = "С телефона" Тогда
			ДобавитьФотоИзГалереи();
		Иначе
			Возврат;
		КонецЕсли; 
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоКамерой()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		ДанныеМультимедиа = Неопределено;
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(, Новый РазрешениеКамерыУстройства(1920, 2400) , 100, , ТипПодсветкиКамеры.Включена);	
		Иначе    
			Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
		КонецЕсли; 

		Если ДанныеМультимедиа <> Неопределено Тогда
			ФайлЗаписан = СоздатьНовыйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла);
			Если ФайлЗаписан Тогда  
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой();
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФотоИзГалереи()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
		Диалог.МножественныйВыбор = Истина;
			
		Если Диалог.Выбрать() Тогда
			МассивФайлов = Диалог.ВыбранныеФайлы;
			Сч = 0;      
			Для Каждого Файл Из МассивФайлов Цикл
				Фото = Новый Файл(Файл);
				Данные = Новый ДвоичныеДанные(Фото.ПолноеИмя);
				ПредставлениеФайла = Фото.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество() - 1];

				ФайлЗаписан = СоздатьНовыйФайл(Данные, Расширение);
				Если ФайлЗаписан Тогда 
					Сч = Сч + 1;
				КонецЕсли;	
			КонецЦикла;
			ПоказатьПредупреждение(, "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		КонецЕсли;	
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция СоздатьНовыйФайл(Данные, Расширение)
	
	Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Центральный склад", Истина) Тогда
		ПапкаСклада = "СП ЦБ\";  		
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Барнаул)", Истина) Тогда
		ПапкаСклада = "СП Барнаул\";
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Выбор)", Истина) Тогда
		ПапкаСклада = "СП Выбор\";
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Бийск)", Истина) Тогда	
		ПапкаСклада = "СП Бийск\"; 
	Иначе 
		ПапкаСклада	= "";
	КонецЕсли; 
	
	СчетчикФото = СчетчикФото + 1; 
	Имя = "" + Объект.Номер + " (" + СчетчикФото + ")";

	ИмяФайла = "\\TG-Storage01\Склад\Общие\Отдел качества\" + ПапкаСклада + "Фото брака\" + Имя + ".png";
	
	Объект.Комментарий = Объект.Комментарий + Символы.ПС + ИмяФайла;
	 
    Попытка 
        Данные.Записать(ИмяФайла);  
		Возврат Истина;
    Исключение 
		Ошибка = ИнформацияОбОшибке();
		ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
		Сообщить(ПодробнаяОшибка);
		Возврат Ложь;
    КонецПопытки;

КонецФункции

#КонецОбласти


#КонецОбласти
